grblHAL/ESP32/main/uart_serial.c
    hal.periph_port.register_pin(&rx1);

#endif // SERIAL2_ENABLE

#if SERIAL3_ENABLE

  #ifdef UART3_TX_PIN
    static const periph_pin_t tx2 = {
        .function = Output_TX,
        .group = PinGroup_UART3,
        .pin = UART3_TX_PIN,
        .mode = { .mask = PINMODE_OUTPUT },
        .description = "Tertiary UART"
    };

    hal.periph_port.register_pin(&tx2);
  #endif

    static const periph_pin_t rx2 = {
        .function = Input_RX,
        .group = PinGroup_UART3,
        .pin = UART3_RX_PIN,
        .mode = { .mask = PINMODE_NONE },
        .description = "Tertiary UART"
    };

    hal.periph_port.register_pin(&rx2);

#endif // SERIAL3_ENABLE

    stream_register_streams(&streams);
}

static void uartSetBaudRate (uart_t *uart, uint32_t baud_rate)
{
    if(uart == NULL)
        return;

    UART_MUTEX_LOCK(uart);
    uart_ll_set_baudrate(uart->dev, baud_rate);
    UART_MUTEX_UNLOCK(uart);
}

static void uartConfig (uart_t *uart, uint32_t baud_rate)
{
#if !CONFIG_DISABLE_HAL_LOCKS
    if(uart->lock == NULL) {
        uart->lock = xSemaphoreCreateMutex();
        if(uart->lock == NULL)
            return;
    }
#endif

//    uart->tx_len = 128;
    uart_ll_set_mode(uart->dev, UART_MODE_UART);

#if CONFIG_IDF_TARGET_ESP32S3

    periph_module_reset((periph_module_t)(PERIPH_UART0_MODULE + uart->num));
    periph_module_enable((periph_module_t)(PERIPH_UART0_MODULE + uart->num));

#else
    switch(uart->num) {

        case 0:
            DPORT_SET_PERI_REG_MASK(DPORT_PERIP_CLK_EN_REG, DPORT_UART_CLK_EN);
            DPORT_CLEAR_PERI_REG_MASK(DPORT_PERIP_RST_EN_REG, DPORT_UART_RST);
            break;

        case 1:
            DPORT_SET_PERI_REG_MASK(DPORT_PERIP_CLK_EN_REG, DPORT_UART1_CLK_EN);
            DPORT_CLEAR_PERI_REG_MASK(DPORT_PERIP_RST_EN_REG, DPORT_UART1_RST);
            break;

        case 2:
            DPORT_SET_PERI_REG_MASK(DPORT_PERIP_CLK_EN_REG, DPORT_UART2_CLK_EN);
            DPORT_CLEAR_PERI_REG_MASK(DPORT_PERIP_RST_EN_REG, DPORT_UART2_RST);
            break;
    }
#endif

    uartSetBaudRate(uart, baud_rate);

    UART_MUTEX_LOCK(uart);

    uart_ll_set_data_bit_num(uart->dev, UART_DATA_8_BITS);
    uart_ll_set_stop_bits(uart->dev, UART_STOP_BITS_1);
    uart_ll_set_parity(uart->dev, UART_PARITY_DISABLE);

    // Note: UART0 pin mappings are set at boot, no need to set here unless override is required

#if SERIAL2_ENABLE ||  SERIAL3_ENABLE

    switch(uart->num) {

 #if SERIAL2_ENABLE
        case 1:
  #ifdef UART2_TX_PIN
            uart_set_pin(uart->num, UART2_TX_PIN, UART2_RX_PIN, UART_PIN_NO_CHANGE, UART_PIN_NO_CHANGE);
  #else
            uart_set_pin(uart->num, UART_PIN_NO_CHANGE, UART2_RX_PIN, UART_PIN_NO_CHANGE, UART_PIN_NO_CHANGE);
  #endif
            break;
 #endif
 #if SERIAL3_ENABLE
        case 2:
  #ifdef UART3_TX_PIN
            uart_set_pin(uart->num, UART3_TX_PIN, UART3_RX_PIN, UART_PIN_NO_CHANGE, UART_PIN_NO_CHANGE);
  #else
            uart_set_pin(uart->num, UART_PIN_NO_CHANGE, UART3_RX_PIN, UART_PIN_NO_CHANGE, UART_PIN_NO_CHANGE);
  #endif
            break;
 #endif
}
#endif // SERIAL2_ENABLE ||  SERIAL3_ENABLE

    UART_MUTEX_UNLOCK(uart);
}

static void uartEnableInterrupt (uart_t *uart, uart_isr_ptr isr, bool enable_rx)
{
    UART_MUTEX_LOCK(uart);

    if(!uart->intr_handle)
        esp_intr_alloc(UART_INTR_SOURCE(uart->num), (int)ESP_INTR_FLAG_IRAM, isr, NULL, &uart->intr_handle);

    uart_ll_set_rxfifo_full_thr(uart->dev, 112);
    uart_ll_set_rx_tout(uart->dev, enable_rx ? 50 : 0);
    uart_ll_clr_intsts_mask(uart->dev, rx_int_flags);
    if(enable_rx)
        uart_ll_ena_intr_mask(uart->dev, rx_int_flags);
    else
        uart_ll_disable_intr_mask(uart->dev, rx_int_flags);

    UART_MUTEX_UNLOCK(uart);
}

IRAM_ATTR static void _uart_flush (uart_t *uart, bool tx_only)
{
    uart_ll_txfifo_rst(uart->dev);
    while(!uart_ll_is_tx_idle(uart->dev));

    if(!tx_only)
        uart_ll_rxfifo_rst(uart->dev);
}

FORCE_INLINE_ATTR uint8_t _uart_ll_read_rxfifo (uart_dev_t *hw)
{
    uint8_t c;
    //Get the UART APB fifo addr. Read fifo, we use APB address
    uint32_t fifo_addr = (hw == &UART0) ? UART_FIFO_REG(0) : (hw == &UART1) ? UART_FIFO_REG(1) : UART_FIFO_REG(2);

    c = READ_PERI_REG(fifo_addr);
#ifdef CONFIG_COMPILER_OPTIMIZATION_PERF
    __asm__ __volatile__("nop");
#endif

    return c;
}

FORCE_INLINE_ATTR void _uart_ll_write_txfifo (uart_dev_t *hw, const uint8_t c)
{
    //Get the UART AHB fifo addr, Write fifo, we use AHB address
    uint32_t fifo_addr = (hw == &UART0) ? UART_FIFO_AHB_REG(0) : (hw == &UART1) ? UART_FIFO_AHB_REG(1) : UART_FIFO_AHB_REG(2);

    WRITE_PERI_REG(fifo_addr, c);
}

FORCE_INLINE_ATTR uint32_t _uart_ll_get_txfifo_count (uart_dev_t *hw)
{
    return HAL_FORCE_READ_U32_REG_FIELD(hw->status, txfifo_cnt);
}

// UART0

IRAM_ATTR static void _uart1_isr (void *arg)
{
    uint32_t c, cnt = uart_ll_get_rxfifo_len(uart1.dev), iflags = uart_ll_get_intsts_mask(uart1.dev);

    uart_ll_clr_intsts_mask(uart1.dev, iflags);

    if(iflags & UART_INTR_RXFIFO_OVF)
        rxbuffer.overflow = On;

    while(cnt) {

        cnt--;
        c = _uart_ll_read_rxfifo(uart1.dev);

        if(!enqueue_realtime_command(c)) {

            uint32_t bptr = (rxbuffer.head + 1) & RX_BUFFER_SIZE_MASK;  // Get next head pointer

            if(bptr == rxbuffer.tail)                   // If buffer full
                rxbuffer.overflow = On;                 // flag overflow,
            else {
                rxbuffer.data[rxbuffer.head] = (char)c; // else add data to buffer
                rxbuffer.head = bptr;                   // and update pointer
            }
        }
    }
}

static uint16_t serialAvailable (void)
{
    uint16_t head = rxbuffer.head, tail = rxbuffer.tail;

    return BUFCOUNT(head, tail, RX_BUFFER_SIZE);
}

uint16_t static serialTxCount (void)
{
    return uart_ll_is_tx_idle(uart1.dev) ? 0 : (uint16_t)_uart_ll_get_txfifo_count(uart1.dev) + 1;
}

static uint16_t serialRXFree (void)
{
    uint16_t head = rxbuffer.head, tail = rxbuffer.tail;

    return (RX_BUFFER_SIZE - 1) - BUFCOUNT(head, tail, RX_BUFFER_SIZE);
}

static int16_t serialRead (void)
{
    int16_t data;
    uint16_t bptr = rxbuffer.tail;

