grblHAL/ESP32/main/uart_serial.c
    if(bptr == rxbuffer.head)
        return -1; // no data available else EOF

    data = rxbuffer.data[bptr++];                 // Get next character, increment tmp pointer
    rxbuffer.tail = bptr & (RX_BUFFER_SIZE - 1);  // and update pointer

    return data;
}

static bool serialPutC (const char c)
{
    while(_uart_ll_get_txfifo_count(uart1.dev) == uart1.tx_len) {
        if(!hal.stream_blocking_callback())
            return false;
    }

    _uart_ll_write_txfifo(uart1.dev, c);

    return true;
}

static void serialWriteS (const char *data)
{
    char c, *ptr = (char *)data;

    while((c = *ptr++) != '\0')
       serialPutC(c);
}

//
// Writes a number of characters from a buffer to the serial output stream, blocks if buffer full
//
void static serialWrite (const char *s, uint16_t length)
{
    char *ptr = (char *)s;

    while(length--)
        serialPutC(*ptr++);
}

IRAM_ATTR static void serialFlush (void)
{
    UART_MUTEX_LOCK(&uart1);

    _uart_flush(&uart1, false);

    rxbuffer.tail = rxbuffer.head;
    rxbuffer.overflow = Off;

    UART_MUTEX_UNLOCK(&uart1);
}

IRAM_ATTR static void serialTxFlush (void)
{
    UART_MUTEX_LOCK(&uart1);

    _uart_flush(&uart1, true);

    UART_MUTEX_UNLOCK(&uart1);
}

IRAM_ATTR static void serialCancel (void)
{
    UART_MUTEX_LOCK(&uart1);

    rxbuffer.data[rxbuffer.head] = ASCII_CAN;
    rxbuffer.tail = rxbuffer.head;
    rxbuffer.head = (rxbuffer.tail + 1) & (RX_BUFFER_SIZE - 1);

    UART_MUTEX_UNLOCK(&uart1);
}

IRAM_ATTR static bool serialSuspendInput (bool suspend)
{
    UART_MUTEX_LOCK(&uart1);

    bool ok = stream_rx_suspend(&rxbuffer, suspend);

    UART_MUTEX_UNLOCK(&uart1);

    return ok;
}

IRAM_ATTR static bool serialDisable (bool disable)
{
    UART_MUTEX_LOCK(&uart1);

    uart_ll_disable_intr_mask(uart1.dev, rx_int_flags);

    if(!disable) {
        // Clear and enable interrupts
        _uart_flush(&uart1, false);
        rxbuffer.tail = rxbuffer.head;
        uart_ll_clr_intsts_mask(uart1.dev, rx_int_flags);
        uart_ll_ena_intr_mask(uart1.dev, rx_int_flags);
    }

    UART_MUTEX_UNLOCK(&uart1);

    return true;
}

static bool serialSetBaudRate (uint32_t baud_rate)
{
    uartSetBaudRate(&uart1, baud_rate);

    return true;
}

static bool serialEnqueueRtCommand (char c)
{
    return enqueue_realtime_command(c);
}

static enqueue_realtime_command_ptr serialSetRtHandler (enqueue_realtime_command_ptr handler)
{
    enqueue_realtime_command_ptr prev = enqueue_realtime_command;

    if(handler)
        enqueue_realtime_command = handler;

    return prev;
}

static const io_stream_t *serialInit (uint32_t baud_rate)
{
    static const io_stream_t stream = {
        .type = StreamType_Serial,
        .state.connected = true,
        .read = serialRead,
        .write = serialWriteS,
        .write_n =  serialWrite,
        .write_char = serialPutC,
        .enqueue_rt_command = serialEnqueueRtCommand,
        .get_rx_buffer_free = serialRXFree,
        .get_rx_buffer_count = serialAvailable,
        .get_tx_buffer_count = serialTxCount,
        .reset_write_buffer = serialTxFlush,
        .reset_read_buffer = serialFlush,
        .cancel_read_buffer = serialCancel,
        .suspend_read = serialSuspendInput,
        .set_baud_rate = serialSetBaudRate,
        .disable_rx = serialDisable,
        .set_enqueue_rt_handler = serialSetRtHandler
    };

    if(serial[0].flags.claimed)
        return NULL;

    serial[0].flags.claimed = On;

    memcpy(&uart1, &_uart_bus_array[0], sizeof(uart_t)); // use UART 0

    uartConfig(&uart1, baud_rate);

    serialFlush();
    uartEnableInterrupt(&uart1, _uart1_isr, true);

    return &stream;
}

#if SERIAL2_ENABLE

static void IRAM_ATTR _uart2_isr (void *arg)
{
    uint32_t c, cnt = uart_ll_get_rxfifo_len(uart2.dev), iflags = uart_ll_get_intsts_mask(uart2.dev);

    uart_ll_clr_intsts_mask(uart2.dev, iflags);

    if(iflags & UART_INTR_RXFIFO_OVF)
        rxbuffer2.overflow = On;

    while(cnt) {

        cnt--;
        c = _uart_ll_read_rxfifo(uart2.dev);

        if(!enqueue_realtime_command2(c)) {

            uint32_t bptr = (rxbuffer2.head + 1) & RX_BUFFER_SIZE_MASK;  // Get next head pointer

            if(bptr == rxbuffer2.tail)                    // If buffer full
                rxbuffer2.overflow = On;                  // flag overflow,
            else {
                rxbuffer2.data[rxbuffer2.head] = (char)c; // else add data to buffer
                rxbuffer2.head = bptr;                    // and update pointer
            }
        }
    }
}

uint16_t static serial2Available (void)
{
    uint16_t head = rxbuffer2.head, tail = rxbuffer2.tail;

    return BUFCOUNT(head, tail, RX_BUFFER_SIZE);
}

uint16_t static serial2TxCount (void)
{
    return uart_ll_is_tx_idle(uart2.dev) ? 0 : (uint16_t)_uart_ll_get_txfifo_count(uart2.dev) + 1;
}

uint16_t static serial2RXFree (void)
{
    uint16_t head = rxbuffer2.head, tail = rxbuffer2.tail;

    return (RX_BUFFER_SIZE - 1) - BUFCOUNT(head, tail, RX_BUFFER_SIZE);
}

bool static serial2PutC (const char c)
{
    UART_MUTEX_LOCK(&uart2);

    while(_uart_ll_get_txfifo_count(uart2.dev) == uart2.tx_len) {
        if(!hal.stream_blocking_callback())
            return false;
    }

    _uart_ll_write_txfifo(uart2.dev, c);

    UART_MUTEX_UNLOCK(&uart2);

    return true;
}

void static serial2WriteS (const char *data)
{
    char c, *ptr = (char *)data;

    while((c = *ptr++) != '\0')
        serial2PutC(c);
}

//
// Writes a number of characters from a buffer to the serial output stream, blocks if buffer full
//
void static serial2Write (const char *s, uint16_t length)
{
    char *ptr = (char *)s;

    while(length--)
        serial2PutC(*ptr++);
}

int16_t static serial2Read (void)
{
    UART_MUTEX_LOCK(&uart2);

    int16_t data;
    uint16_t bptr = rxbuffer2.tail;

    if(bptr == rxbuffer2.head) {
        UART_MUTEX_UNLOCK(&uart2);
        return -1; // no data available else EOF
    }

    data = rxbuffer2.data[bptr++];                 // Get next character, increment tmp pointer
    rxbuffer2.tail = bptr & (RX_BUFFER_SIZE - 1);  // and update pointer

    UART_MUTEX_UNLOCK(&uart2);

