grblHAL/ESP32/main/uart_serial.c
    return data;
}

IRAM_ATTR static void serial2Flush (void)
{
    UART_MUTEX_LOCK(&uart2);

    _uart_flush(&uart2, false);

    rxbuffer2.tail = rxbuffer2.head;
    rxbuffer2.overflow = Off;

    UART_MUTEX_UNLOCK(&uart2);
}

IRAM_ATTR static void serial2TxFlush (void)
{
    UART_MUTEX_LOCK(&uart2);

    _uart_flush(&uart2, true);

    UART_MUTEX_UNLOCK(&uart2);
}

IRAM_ATTR static void serial2Cancel (void)
{
    UART_MUTEX_LOCK(&uart2);

    rxbuffer2.data[rxbuffer2.head] = ASCII_CAN;
    rxbuffer2.tail = rxbuffer2.head;
    rxbuffer2.head = (rxbuffer2.tail + 1) & (RX_BUFFER_SIZE - 1);

    UART_MUTEX_UNLOCK(&uart2);
}

static bool serial2SuspendInput (bool suspend)
{
    bool ok;

    UART_MUTEX_LOCK(&uart2);

    ok = stream_rx_suspend(&rxbuffer2, suspend);

    UART_MUTEX_UNLOCK(&uart2);

    return ok;
}

IRAM_ATTR static bool serial2Disable (bool disable)
{
    UART_MUTEX_LOCK(&uart2);

    uart_ll_disable_intr_mask(uart2.dev, rx_int_flags);

    if(!disable) {
        // Clear and enable interrupts
        _uart_flush(&uart2, false);
        rxbuffer2.tail = rxbuffer2.head;
        uart_ll_clr_intsts_mask(uart2.dev, rx_int_flags);
        uart_ll_ena_intr_mask(uart2.dev, rx_int_flags);
    }

    UART_MUTEX_UNLOCK(&uart2);

    return true;
}

static bool serial2SetBaudRate (uint32_t baud_rate)
{
    uartSetBaudRate(&uart2, baud_rate);

    return true;
}

static bool serial2EnqueueRtCommand (char c)
{
    return enqueue_realtime_command2(c);
}

static enqueue_realtime_command_ptr serial2SetRtHandler (enqueue_realtime_command_ptr handler)
{
    enqueue_realtime_command_ptr prev = enqueue_realtime_command2;

    if(handler)
        enqueue_realtime_command2 = handler;

    return prev;
}

static const io_stream_t *serial2Init (uint32_t baud_rate)
{
    static const io_stream_t stream = {
        .type = StreamType_Serial,
        .instance = 1,
        .state.connected = true,
        .read = serial2Read,
        .write = serial2WriteS,
        .write_n =  serial2Write,
        .write_char = serial2PutC,
        .enqueue_rt_command = serial2EnqueueRtCommand,
        .get_rx_buffer_free = serial2RXFree,
        .get_rx_buffer_count = serial2Available,
        .get_tx_buffer_count = serial2TxCount,
        .reset_write_buffer = serial2TxFlush,
        .reset_read_buffer = serial2Flush,
        .cancel_read_buffer = serial2Cancel,
        .suspend_read = serial2SuspendInput,
        .set_baud_rate = serial2SetBaudRate,
        .disable_rx = serial2Disable,
        .set_enqueue_rt_handler = serial2SetRtHandler
    };

    if(serial[1].flags.claimed)
        return NULL;

    serial[1].flags.claimed = On;

    memcpy(&uart2, &_uart_bus_array[1], sizeof(uart_t)); // use UART 1

    uartConfig(&uart2, baud_rate);

    serial2Flush();
#ifdef UART2_TX_PIN
    uartEnableInterrupt(&uart2, _uart2_isr, true);
#else
    uartEnableInterrupt(&uart2, _uart2_isr, false);
#endif

    return &stream;
}

#endif // SERIAL2_ENABLE

#if SERIAL3_ENABLE

static void IRAM_ATTR _uart3_isr (void *arg)
{
    uint32_t c, cnt = uart_ll_get_rxfifo_len(uart3.dev), iflags = uart_ll_get_intsts_mask(uart3.dev);

    uart_ll_clr_intsts_mask(uart3.dev, iflags);

    if(iflags & UART_INTR_RXFIFO_OVF)
        rxbuffer3.overflow = On;

    while(cnt) {

        cnt--;
        c = _uart_ll_read_rxfifo(uart3.dev);

        if(!enqueue_realtime_command3(c)) {

            uint32_t bptr = (rxbuffer3.head + 1) & RX_BUFFER_SIZE_MASK;  // Get next head pointer

            if(bptr == rxbuffer3.tail)                    // If buffer full
                rxbuffer3.overflow = On;                  // flag overflow,
            else {
                rxbuffer3.data[rxbuffer3.head] = (char)c; // else add data to buffer
                rxbuffer3.head = bptr;                    // and update pointer
            }
        }
    }
}

uint16_t static serial3Available (void)
{
    uint16_t head = rxbuffer3.head, tail = rxbuffer3.tail;

    return BUFCOUNT(head, tail, RX_BUFFER_SIZE);
}

uint16_t static serial3TxCount (void)
{
    return uart_ll_is_tx_idle(uart3.dev) ? 0 : (uint16_t)_uart_ll_get_txfifo_count(uart3.dev) + 1;
}

uint16_t static serial3RXFree (void)
{
    uint16_t head = rxbuffer3.head, tail = rxbuffer3.tail;

    return (RX_BUFFER_SIZE - 1) - BUFCOUNT(head, tail, RX_BUFFER_SIZE);
}

bool static serial3PutC (const char c)
{
    UART_MUTEX_LOCK(&uart3);
    serialPutC(c);
    while(_uart_ll_get_txfifo_count(uart3.dev) == uart3.tx_len) {
        if(!hal.stream_blocking_callback())
            return false;
    }

    _uart_ll_write_txfifo(uart3.dev, c);

    UART_MUTEX_UNLOCK(&uart3);

    return true;
}

void static serial3WriteS (const char *data)
{
    char c, *ptr = (char *)data;

    while((c = *ptr++) != '\0')
        serial3PutC(c);
}

//
// Writes a number of characters from a buffer to the serial output stream, blocks if buffer full
//
void static serial3Write (const char *s, uint16_t length)
{
    char *ptr = (char *)s;

    while(length--)
        serial3PutC(*ptr++);
}

int16_t static serial3Read (void)
{
    UART_MUTEX_LOCK(&uart3);

    int16_t data;
    uint16_t bptr = rxbuffer3.tail;

    if(bptr == rxbuffer3.head) {
        UART_MUTEX_UNLOCK(&uart3);
        return -1; // no data available else EOF
    }

    data = rxbuffer3.data[bptr++];                 // Get next character, increment tmp pointer
    rxbuffer3.tail = bptr & (RX_BUFFER_SIZE - 1);  // and update pointer

    UART_MUTEX_UNLOCK(&uart3);

    return data;
}

IRAM_ATTR static void serial3Flush (void)
{
    UART_MUTEX_LOCK(&uart3);

    _uart_flush(&uart3, false);

    rxbuffer3.tail = rxbuffer3.head;
    rxbuffer3.overflow = Off;

    UART_MUTEX_UNLOCK(&uart3);
}

IRAM_ATTR static void serial3TxFlush (void)
{
    UART_MUTEX_LOCK(&uart3);

    _uart_flush(&uart3, true);

    UART_MUTEX_UNLOCK(&uart3);
}

IRAM_ATTR static void serial3Cancel (void)
{
    UART_MUTEX_LOCK(&uart3);

    rxbuffer3.data[rxbuffer3.head] = ASCII_CAN;
    rxbuffer3.tail = rxbuffer3.head;
    rxbuffer3.head = (rxbuffer3.tail + 1) & (RX_BUFFER_SIZE - 1);

    UART_MUTEX_UNLOCK(&uart3);
}

static bool serial3SuspendInput (bool suspend)
{
    bool ok;

    UART_MUTEX_LOCK(&uart3);

    ok = stream_rx_suspend(&rxbuffer3, suspend);

    UART_MUTEX_UNLOCK(&uart3);

    return ok;
}

IRAM_ATTR static bool serial3Disable (bool disable)
{
    UART_MUTEX_LOCK(&uart3);

    uart_ll_disable_intr_mask(uart3.dev, rx_int_flags);

    if(!disable) {
        // Clear and enable interrupts
        _uart_flush(&uart3, false);
        rxbuffer3.tail = rxbuffer3.head;
        uart_ll_clr_intsts_mask(uart3.dev, rx_int_flags);
        uart_ll_ena_intr_mask(uart3.dev, rx_int_flags);
    }

    UART_MUTEX_UNLOCK(&uart3);

