grblHAL/ESP32/main/uart_serial.c
    return true;
}

static bool serial3SetBaudRate (uint32_t baud_rate)
{
    uartSetBaudRate(&uart3, baud_rate);

    return true;
}

static bool serial3EnqueueRtCommand (char c)
{
    return enqueue_realtime_command3(c);
}

static enqueue_realtime_command_ptr serial3SetRtHandler (enqueue_realtime_command_ptr handler)
{
    enqueue_realtime_command_ptr prev = enqueue_realtime_command3;

    if(handler)
        enqueue_realtime_command3 = handler;

    return prev;
}

static const io_stream_t *serial3Init (uint32_t baud_rate)
{
    static const io_stream_t stream = {
        .type = StreamType_Serial,
        .instance = 2,
        .state.connected = true,
        .read = serial3Read,
        .write = serial3WriteS,
        .write_n =  serial3Write,
        .write_char = serial3PutC,
        .enqueue_rt_command = serial3EnqueueRtCommand,
        .get_rx_buffer_free = serial3RXFree,
        .get_rx_buffer_count = serial3Available,
        .get_tx_buffer_count = serial3TxCount,
        .reset_write_buffer = serial3TxFlush,
        .reset_read_buffer = serial3Flush,
        .cancel_read_buffer = serial3Cancel,
        .suspend_read = serial3SuspendInput,
        .set_baud_rate = serial3SetBaudRate,
        .disable_rx = serial3Disable,
        .set_enqueue_rt_handler = serial3SetRtHandler
    };

    if(serial[2].flags.claimed)
        return NULL;

    serial[2].flags.claimed = On;

    memcpy(&uart3, &_uart_bus_array[2], sizeof(uart_t)); // use UART 2

    uartConfig(&uart3, baud_rate);

    serial3Flush();
#ifdef UART3_TX_PIN
    uartEnableInterrupt(&uart3, _uart3_isr, true);
#else
    uartEnableInterrupt(&uart3, _uart3_isr, false);
#endif

    return &stream;
}

#endif // SERIAL3_ENABLE
